

// src/utils/getVaccineAdvice.js
export const getVaccineAdvice = (months) => {
  const advices = {
    0: {
      medical:
        "تنبيه: حقنة الكبدي (B) في أول 24 ساعة فقط. تحليل الغدة والسمع بين اليوم الـ 3 والـ 7 (السبت والثلاثاء فقط).",
      nutrition: "الرضاعة الطبيعية المطلقة هي الأفضل في أول 6 أشهر.",
      documents:
        "شهادة الميلاد مجانية خلال 14 يوماً. المطلوب: بطاقات الأبوين، قسيمة الزواج، إخطار الولادة (نسختين لكل ورقة).",
      important:
        "حضور الأب ضروري، وفي حال تعذره يحضر (الجد أو العم) مع أصل الأوراق وصورتين من بطاقة المبلغ.",
    },
    2: {
      medical: "تطعيم الـ شهرين يحمي من 5 أمراض أساسية.",
      nutrition: "استمري في الرضاعة الطبيعية بانتظام.",
      tips: "في أول يوم: كمادات مياه فاترة تحت الإبط و على الرأس (الجبين) وبين الفخذين (أماكن خفض الحرارة) - من ثاني يوم: كمادات مياه فاترة على مكان الحقن - في حال السخونية نعطي خافض حرارة حسب الوزن."
    },
    4: {
      medical: "الجرعة الثانية من التطعيمات.",
      nutrition: "الرضاعة كل ساعتين إلى 3 ساعات.",
      tips: "في أول يوم: كمادات مياه فاترة تحت الإبط و على الرأس (الجبين) وبين الفخذين (أماكن خفض الحرارة) - من ثاني يوم: كمادات مياه فاترة على مكان الحقن - في حال السخونية نعطي خافض حرارة حسب الوزن."
    },
    6: {
      medical: "الجرعة الثالثة وفيتامين (أ).",
      nutrition:
        "ابدئي بإدخال الخضروات المسلوقة المهروسة تدريجياً بجانب الرضاعة.",
      tips: "في أول يوم: كمادات مياه فاترة تحت الإبط و على الرأس (الجبين) وبين الفخذين (أماكن خفض الحرارة) - من ثاني يوم: كمادات مياه فاترة على مكان الحقن - في حال السخونية نعطي خافض حرارة حسب الوزن."
    },
    9: {
      medical: "كبسولة فيتامين (أ) لتقوية المناعة ونمو النظر.",
      nutrition: "نوعي في الفواكه المسلوقة والمهروسة.",
      tips: "الطفل قد يبدأ بالجلوس بمفرده.",
    },
    12: {
      medical: "تطعيم الحصبة والنكاف والحصبة الألمانية (MMR).",
      nutrition: "يمكن البدء بمنتجات الألبان (زبادي) والعسل بعد إتمام العام.",
      tips: "شجعي طفلك على الكلام بترديد كلمات بسيطة.",
    },
    18: {
      medical: "الجرعة المنشطة وفيتامين (أ).",
      nutrition: "الطفل يأكل من طعام الأسرة العادي مع تقليل الملح والسكر.",
      tips: "تأكدي من أخذ تطعيم شلل الأطفال الجرعة المنشطة.",
    },
  };
  return (
    advices[months] || { medical: "واصلي المتابعة الدورية مع مكتب الصحة." }
  );
};
